app/services/user_key_service.rb

SELECT  "user_keys".* FROM "user_keys" WHERE "user_keys"."user_id" = $1 ORDER BY "user_keys"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def first_or_initialize_user_key
    user_data = UserKey.where(user_id: @user_id).first_or_initialize(key: generate_user_key)