app/controllers/user_keys_controller.rb

SELECT  "user_keys".* FROM "user_keys" WHERE "user_keys"."user_id" = $1 ORDER BY "user_keys"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def get_user_key
    data = UserKeyService.new(user_params)
    data.get_key
    return render json: { errs: data.errors }, status: data.status_code if data.errors.any?